<script setup lang="ts">
    import { isMobile } from '../../helpers/helpers';

    const emit = defineEmits(['read']);

</script>

<template>
    <div>
        <p>注意：このヘルプは暫定です。予告なく変更される場合があります。</p>
        <h4>1. 交差点を絞り込む</h4>
        <p>詳細検索を行う際と同様に、交差点を絞り込んでください。お使いのPC（ブラウザ）スペックにもよりますが、一度に編集できる交差点は概ね100～200程度となります。なので編集したい交差点数がこの数になるまで絞り込みましょう。</p>

        <h4>2. 編集を開始する</h4>
        <p>編集したい内容を編集してください。選択肢がある場合はそこから選んでください。なお、既存の行の<b>都道府県は変更できません</b>ので、ご了承ください。</p>
        <p>行を追加したい場合は「行を追加する」をクリックすることで、1行追加することができます。誤って大量に追加してしまった場合は「都道府県」の項目を空にすることでその行は取り扱われなくなります。</p>
        <p>表は横にスクロールできますので、必要に応じてスクロールしてください。スマートフォンなどをお使いの場合は大変見づらいので、パソコンなどで編集することをお勧めします。</p>
        <p>編集を開始した後再度検索を行うと今までの編集内容はすべて消えますのでご了承ください。</p>
        <p>緯度経度はGoogleMapの形式（緯度,経度）でコピペできます。貼り付ける際はブラウザから許可を求められるので許可してください。</p>

        <h4>3. 状態の保存・読み込みについて</h4>
        <p>編集した内容は、「状態を保存する」「状態を読み込む」のボタンをクリックすることで一時保存することができます。このデータはお使いのブラウザに保存されますので、同一のブラウザを使用していれば半永久的に保存可能です。Webでの編集は良からぬデータの消失が発生しうるので、一時保存としてお使いください。</p>
        <p>※なお、おおよそ1000件以上の編集は保存できませんのでご了承ください。</p>

        <h4>4. 編集内容を確認する</h4>
        <p>クリックすると、編集した差分がダイアログとして表示されますので、差分を確認したうえで「OK」をクリックしてください。サーバー側で入力内容に矛盾がないかのチェックが行われます。チェックが完了すると、編集を確定できます。</p>
        <p>予備調査の編集は承認待ちはなく即時反映となりますのでご注意ください。</p>

        <h4>エラーが発生した場合は</h4>
        <p>エラーメッセージの指示に従ってください。</p>

        

        <p><a @click="emit('read')" style="text-decoration: underline; cursor: pointer;">ここをクリックすると閉じます（一度閉じるとデフォルトでは開かなくなります）</a></p>
    </div>
</template>

<style scoped>

</style>