<script setup lang="ts">
    import { isMobile } from '../../helpers/helpers';

    const emit = defineEmits(['read']);

</script>

<template>
    <div>
        <p>詳しくは後日作成予定の動画や説明書をご覧ください。</p>
        <div class="warn" v-if="isMobile()">
            <p>画面解像度が足りません</p>
            <p>パソコンでの使用を考慮したつくりとなっているため、スマートフォン・タブレットなどでの予備調査は大変困難を極める可能性があります。ご了承ください。</p>
        </div>
        <h4>1. 予備調査対象となる場所を絞り込む</h4>
        <p>都道府県コード、エリアコード、管理番号等を用いて、該当する予備調査の箇所を絞り込みます。何も絞り込まない状態だと全件が編集可能となりますが、よからぬ誤爆を防ぐためとブラウザー及びサーバー負荷を最小限にするため、一度に編集できる件数は制限しています。</p>
        <div class="warn">
            <p>どのくらいまで対応できるか</p>
            <p>サーバー側としては概ね50000件ほどまでは処理できることを確認していますが、フォームの部品数によってブラウザー側で管理がしきれなくなることが多いです。概ねフォームの部品数が1000を超え始めると露骨に重くなります。可能な限り部品数も加味して500件以下に絞り込むことをお勧めします。</p>
        </div>
        
        <h4>2. 編集・修正を行う</h4>
        <p>上記の絞り込みをした状態で編集修正を行います。各フォームは内容をなるべく正規化できるように最適化していますので、選択肢がある場合はそこから選んでください。入力する内容に関しては予備調査の仕様書（作成中）をお読みください。</p>

        <h4>3. 行の追加を行う（必要なら）</h4>
        <p>そもそも絞り込んでも行が何も出てこない場合は、行を追加することができます。例えば新設交差点の情報を入力する場合などが該当します。この場合、「行を追加する」ボタンをクリックすることで行が追加されます。</p>
        <div class="info">
            <p>行の削除はできません</p>
            <p>削除はリスクの伴う内容のため、行を削除することはできません。</p>
        </div>

        <h4>4. 変更内容の保存を行う</h4>
        <p>変更内容を一時的にお使いのブラウザに保存することができます。保存を行うことで、別の絞り込みに切り替えても編集内容が保存されます。</p>
        <div class="warn">
            <p>編集内容をどれくらい保存できるのかには限りがあります</p>
            <p>ブラウザーのLocalStorage（一時保存領域）に保存します。タブを閉じたりブラウザーを閉じたり再起動すると情報は失われます。<a href="https://developer.mozilla.org/ja/docs/Web/API/Storage_API/Storage_quotas_and_eviction_criteria" target="_blank">Mozillaによれば、</a>たいていのブラウザーは10MiBとされています（多分1000件程度）。保存できなかった場合は個別に申請してください。</p>
        </div>

        <h4>5. 変更内容を申請する</h4>
        <p>予備調査がすべて完了したら、その内容を反映させるために申請を行ってください。システム側で不備がないかを自動的にチェックし、問題がなければその内容で登録・更新を行います（特に最高管理者による審査はありません）。</p>
        <p>申請する前に必ず編集内容が正しいかどうかの確認は行ってください。</p>

        <div class="error">
            <p>申請内容が消えた場合でも責任は負いません</p>
            <p>スプレッドシート等に控えを保存してご利用ください。</p>
        </div>

        <p><a @click="emit('read')" style="text-decoration: underline; cursor: pointer;">ここをクリックすると閉じます（一度閉じるとデフォルトでは開かなくなります）</a></p>
    </div>
</template>

<style scoped>

</style>